xu-yingjing/micropython-port/boards/esp32/ATK_DNESP32S3B/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME           "ATK-DNESP32S3"
#define MICROPY_HW_MCU_NAME             "ESP32-S3R8"

#define MICROPY_HW_ENABLE_UART_REPL     (1)
